In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
data = {"isim":["ali", "elif", "fatma", "mehmet"], "boy cm":[1.70, 1.55, 1.60, 1.90], "kilo-kg": [70, 55, 60, 80]}

In [6]:
df = pd.DataFrame(data, index = ["A", "B", "C", "D"])
df

     isim  boy cm  kilo-kg
A     ali    1.70       70
B    elif    1.55       55
C   fatma    1.60       60
D  mehmet    1.90       80

In [7]:
df.isim

A       ali
B      elif
C     fatma
D    mehmet
Name: isim, dtype: object

In [8]:
df[["isim"]]

     isim
A     ali
B    elif
C   fatma
D  mehmet

In [9]:
df[isim]

NameError: name 'isim' is not defined

In [10]:
df.isim

A       ali
B      elif
C     fatma
D    mehmet
Name: isim, dtype: object

In [11]:
 df.boy cm #koeli parantez kullanmaya ozen gosterelim.

SyntaxError: invalid syntax (1165061042.py, line 1)

In [12]:
df[["kilo-kg", "isim"]]

   kilo-kg    isim
A       70     ali
B       55    elif
C       60   fatma
D       80  mehmet

In [13]:
df["isim"]

A       ali
B      elif
C     fatma
D    mehmet
Name: isim, dtype: object

In [15]:
df["A":"C"] #LABELLARE gor ecagitinca son yazilan sutunu da dahil eder.

    isim  boy cm  kilo-kg
A    ali    1.70       70
B   elif    1.55       55
C  fatma    1.60       60

In [16]:
df["isim"]["B"]

'elif'

In [18]:
df["boy*kilo"] = df["boy cm"] * df["kilo-kg"]
df

     isim  boy cm  kilo-kg  boy*kilo
A     ali    1.70       70    119.00
B    elif    1.55       55     85.25
C   fatma    1.60       60     96.00
D  mehmet    1.90       80    152.00

In [19]:
df["new"] = np.arange(4)

In [20]:
df

     isim  boy cm  kilo-kg  boy*kilo  new
A     ali    1.70       70    119.00    0
B    elif    1.55       55     85.25    1
C   fatma    1.60       60     96.00    2
D  mehmet    1.90       80    152.00    3

In [21]:
df.drop("new", axis=1)

     isim  boy cm  kilo-kg  boy*kilo
A     ali    1.70       70    119.00
B    elif    1.55       55     85.25
C   fatma    1.60       60     96.00
D  mehmet    1.90       80    152.00

In [22]:
data = np.arange(20).reshape(5,4)

In [23]:
df = pd.DataFrame(data=data, columns=["col1","col2","col3","col4"], index=range(1,6))
df

   col1  col2  col3  col4
1     0     1     2     3
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [24]:
df.loc[3]

col1     8
col2     9
col3    10
col4    11
Name: 3, dtype: int32

In [25]:
df.loc[2:5]

   col1  col2  col3  col4
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [26]:
df[2:5]

   col1  col2  col3  col4
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [27]:
df.iloc[2:5]

   col1  col2  col3  col4
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [28]:
df.index = "a b c d e".split()

In [29]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [30]:
df.loc["b":"d"]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [35]:
df.iloc[1:4]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [37]:
df.loc["b","col2"]

5

In [38]:
df.iloc[1,1]

5

In [41]:
df = pd.DataFrame(np.random.randn(5,4), index="a b c d e".split(), columns=["A","B","C","D"])
df

          A         B         C         D
a  1.318052 -0.640557 -1.289049  0.966807
b -0.127466  1.266787 -2.122020  1.086450
c  0.309178  1.239462 -0.202395 -0.865051
d -0.360350  0.303560 -0.144187  0.237268
e -0.320683 -0.058923 -0.991037 -0.481244

In [42]:
df > 0

       A      B      C      D
a   True  False  False   True
b  False   True  False   True
c   True   True  False  False
d  False   True  False   True
e  False  False  False  False

In [43]:
df[df>0]

          A         B   C         D
a  1.318052       NaN NaN  0.966807
b       NaN  1.266787 NaN  1.086450
c  0.309178  1.239462 NaN       NaN
d       NaN  0.303560 NaN  0.237268
e       NaN       NaN NaN       NaN

In [45]:
df[df["A"]>0][["C"]] #A'da istenen kosullari saglayan C sutunundaki degerleri getiriyor.

          C
a -1.289049
c -0.202395

In [47]:
df[(df["A"]>0) & (df["B"]<0)]

          A         B         C         D
a  1.318052 -0.640557 -1.289049  0.966807

In [48]:
df[(df["A"]>0) | (df["B"]<0)]

          A         B         C         D
a  1.318052 -0.640557 -1.289049  0.966807
c  0.309178  1.239462 -0.202395 -0.865051
e -0.320683 -0.058923 -0.991037 -0.481244

In [49]:

df

          A         B         C         D
a  1.318052 -0.640557 -1.289049  0.966807
b -0.127466  1.266787 -2.122020  1.086450
c  0.309178  1.239462 -0.202395 -0.865051
d -0.360350  0.303560 -0.144187  0.237268
e -0.320683 -0.058923 -0.991037 -0.481244

In [51]:
df.drop("D", axis=1)

          A         B         C
a  1.318052 -0.640557 -1.289049
b -0.127466  1.266787 -2.122020
c  0.309178  1.239462 -0.202395
d -0.360350  0.303560 -0.144187
e -0.320683 -0.058923 -0.991037

In [52]:
import seaborn as sns

In [53]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [54]:
df = sns.load_dataset("titanic")

In [55]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [56]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [57]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [58]:
df.sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
132,0,3,female,47.0,1,0,14.5000,S,Third,woman,False,NaN,Southampton,no,False
41,0,2,female,27.0,1,0,21.0000,S,Second,woman,False,NaN,Southampton,no,False
782,0,1,male,29.0,0,0,30.0000,S,First,man,True,D,Southampton,no,True
162,0,3,male,26.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
428,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
580,1,2,female,25.0,1,1,30.0000,S,Second,woman,False,NaN,Southampton,yes,False
154,0,3,male,NaN,0,0,7.3125,S,Third,man,True,NaN,Southampton,no,True
37,0,3,male,21.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
119,0,3,female,2.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False

In [60]:
df.shape

(891, 15)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [62]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [63]:
import warnings

In [64]:
warnings.filterwarnings("ignore")

In [65]:
df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [66]:
df["survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [67]:
df.survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [68]:
data = {'Company':['Amazon', 'Amazon', 'OpenAI', 'OpenAI', 'Amazon', 'OpenAI', 'Amazon', 'OpenAI'],
        'Department':['IT', 'HR', 'IT', 'HR', 'IT', 'HR', 'HR', 'IT'],
        'Person':['Ahmet', 'Ece', 'Fatma', 'Mehmet', 'Zeynep', 'Ali', 'Yusuf', 'Elif'],
        'Age':[32, 26, 35, 40, 25, 38, 30, 28],
        'Sales':[180, 160, 150, 180, 240, 200, 220, 160]}

In [69]:
df = pd.DataFrame(data)
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [70]:
df.agg([sum,min])

,Company,Department,Person,Age,Sales
sum,AmazonAmazonOpenAIOpenAIAmazonOpenAIAmazonOpenAI,ITHRITHRITHRHRIT,AhmetEceFatmaMehmetZeynepAliYusufElif,254,1490
min,Amazon,HR,Ahmet,25,150

In [71]:
"a" + "l" + "i"

'ali'

In [72]:
df.agg({"Age": sum, "Sales": min})

Age      254
Sales    150
dtype: int64

In [73]:
df.agg({"Age":[sum], "Sales":[min,max]})

       Age  Sales
sum  254.0    NaN
min    NaN  150.0
max    NaN  240.0

In [74]:
df.agg({"Age":[sum,np.mean], "Sales":[min,max]})

         Age  Sales
sum   254.00    NaN
mean   31.75    NaN
min      NaN  150.0
max      NaN  240.0

In [75]:
df.groupby("Company").mean()

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [76]:
df.groupby("Company")[["Sales"]].mean()

         Sales
Company
Amazon   200.0
OpenAI   172.5

In [78]:
df.groupby("Company")[["Company"]].count()

         Company
Company
Amazon         4
OpenAI         4

In [79]:
df.Company.value_counts()

Amazon    4
OpenAI    4
Name: Company, dtype: int64

In [80]:
df.groupby(["Company","Department"]).mean()

                     Age  Sales
Company Department
Amazon  HR          28.0  190.0
        IT          28.5  210.0
OpenAI  HR          39.0  190.0
        IT          31.5  155.0

In [81]:
df.Sales.min()

150

In [82]:
df.groupby("Company")[["Sales"]].idxmax()

         Sales
Company
Amazon       4
OpenAI       5

In [83]:
compare = df.groupby("Company")

In [84]:
compare.mean()

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [85]:
compare.corr()

                    Age     Sales
Company
Amazon  Age    1.000000 -0.221032
        Sales -0.221032  1.000000
OpenAI  Age    1.000000  0.593934
        Sales  0.593934  1.000000

In [86]:
df[["Age"]]

   Age
0   32
1   26
2   35
3   40
4   25
5   38
6   30
7   28

In [87]:
df[["Company","Age"]]

  Company  Age
0  Amazon   32
1  Amazon   26
2  OpenAI   35
3  OpenAI   40
4  Amazon   25
5  OpenAI   38
6  Amazon   30
7  OpenAI   28

In [88]:
df.filter(regex="^Com", axis=1)

  Company
0  Amazon
1  Amazon
2  OpenAI
3  OpenAI
4  Amazon
5  OpenAI
6  Amazon
7  OpenAI

In [89]:
df.filter(like="art", axis=1)

  Department
0         IT
1         HR
2         IT
3         HR
4         IT
5         HR
6         HR
7         IT

In [90]:
df.filter(like="3", axis=0)

  Company Department  Person  Age  Sales
3  OpenAI         HR  Mehmet   40    180

In [91]:
df.groupby("Company").mean()

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [92]:
df.groupby("Company").filter(lambda x : x["Age"].mean() < 30)

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
4  Amazon         IT  Zeynep   25    240
6  Amazon         HR   Yusuf   30    220

In [95]:
(lambda x : x["Age"].mean() < 30)(df.groupby("Company"))

Company
Amazon     True
OpenAI    False
Name: Age, dtype: bool

In [97]:
df_num = df.iloc[:,3:]
df_num.applymap(lambda x : x*10)

   Age  Sales
0  320   1800
1  260   1600
2  350   1500
3  400   1800
4  250   2400
5  380   2000
6  300   2200
7  280   1600

In [98]:
df.groupby("Company")["Age"].transform("mean")

0    28.25
1    28.25
2    35.25
3    35.25
4    28.25
5    35.25
6    28.25
7    35.25
Name: Age, dtype: float64

In [99]:
df.applymap(lambda x : len(str(x)))

   Company  Department  Person  Age  Sales
0        6           2       5    2      3
1        6           2       3    2      3
2        6           2       5    2      3
3        6           2       6    2      3
4        6           2       6    2      3
5        6           2       3    2      3
6        6           2       5    2      3
7        6           2       4    2      3

In [100]:
print("1", 0 * np.nan)
print("2", np.nan - np.nan)
print("3", np.nan + np.nan)
print("4", np.nan - 10)
print("5", np.nan + 10)
print("6", np.nan == np.nan)
print("7", 10 > np.nan)
print("8", np.inf > np.nan)
print("9", float('-inf') < np.nan < float('inf'))
print("10", np.nan is np.nan)

1 nan
2 nan
3 nan
4 nan
5 nan
6 False
7 False
8 False
9 False
10 True